var myChart = echarts.init(document.getElementById("flower"));

var companies = {
  半导体: ["京东方科技集团股份有限公司", "深圳市江波龙电子股份有限公司"],
  "电信、通讯和计算机软硬件": [
    "华为投资控股有限公司",
    "腾讯科技（深圳）有限公司",
    "联想集团",
    "中兴通讯股份有限公司",
    "武汉光迅科技股份有限公司",
  ],
  电子商务及生活服务: [
    "阿里巴巴集团控股有限公司",
    "北京字节跳动科技有限公司",
    "京东集团股份有限公司",
    "赤子城科技有限公司",
  ],
  高端制造: [
    "比亚迪股份有限公司",
    "小米集团",
    "工业富联",
    "苏州迈为科技股份有限公司",
    "蓝思科技股份有限公司",
    "小鹏汽车科技有限公司",
    "海尔智家股份有限公司",
    "海克斯康制造智能技术（青岛）有限公司",
    "TCL科技集团股份有限公司",
    "浙江时空道宇科技有限公司",
    "无锡先导智能装备股份有限公司",
    "华勤技术股份有限公司",
    "重庆摩方精密科技股份有限公司",
    "深圳市优必选科技股份有限公司",
    "东方空间（山东）科技有限公司",
    "国仪量子技术（合肥）股份有限公司",
  ],
  人工智能: [
    "百度",
    "北京月之暗面科技有限公司",
    "科大讯飞股份有限公司",
    "小马智行",
    "北京海天瑞声科技股份有限公司",
  ],
  生命健康: [
    "江苏恒瑞医药股份有限公司",
    "上海联影医疗科技股份有限公司",
    "药明合联生物技术有限公司",
    "深圳市朗坤环境集团股份有限公司",
  ],
  数字经济: [
    "恒生电子股份有限公司",
    "浪潮集团有限公司",
    "神州数码信息服务集团股份有限公司",
    "深圳云天畅想信息科技有限公司",
  ],
  新能源及新材料: [
    "宁德时代新能源科技股份有限公司",
    "晶科能源股份有限公司",
    "隆基绿能科技股份有限公司",
    "阳光电源股份有限公司",
    "万华化学集团股份有限公司",
    "金风科技股份有限公司",
    "欣旺达动力科技股份有限公司",
    "永荣控股集团有限公司",
    "云南恩捷新材料股份有限公司",
    "上海重塑能源集团股份有限公司",
  ],
};

var option = {
  title: {
    text: "",
  },
  tooltip: {
    trigger: "item",
    formatter: function (params) {
      var companyList = companies[params.name] || [];
      var companyNames = companyList.join("<br/>");
      return (
        '<span style="font-size: 16px; font-weight: bold;">' +
        params.name +
        "</span><br/>公司名单:<br/>" +
        companyNames
      );
    },
  },
  legend: {
    orient: "vertical",
    left: "left",
    top: 50,
    data: [
      "半导体",
      "电信、通讯和计算机软硬件",
      "电子商务及生活服务",
      "高端制造",
      "人工智能",
      "生命健康",
      "数字经济",
      "新能源及新材料",
    ],
  },
  series: [
    {
      name: "公司赛道",
      type: "pie",
      radius: [40, 200],
      roseType: "radius",
      data: [
        { name: "高端制造", value: 15 },
        { name: "新能源及新材料", value: 10 },
        { name: "电子商务及生活服务", value: 4 },
        { name: "电信、通讯和计算机软硬件", value: 4 },
        { name: "人工智能", value: 4 },
        { name: "生命健康", value: 4 },
        { name: "数字经济", value: 4 },
        { name: "半导体", value: 2 },
      ],
      emphasis: {
        itemStyle: {
          shadowBlur: 10,
          shadowOffsetX: 0,
          shadowColor: "rgba(0, 0, 0, 0.5)",
        },
      },
    },
  ],
};

myChart.setOption(option);
